{"class_name": "Functional", "config": {"name": "Model_0_Bret", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 14, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "Input"}, "name": "Input", "inbound_nodes": []}, {"class_name": "TCN", "config": {"name": "TCN", "trainable": true, "dtype": "float32", "nb_filters": 32, "kernel_size": 6, "nb_stacks": 1, "dilations": [1, 2, 4, 8], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": false, "kernel_initializer": "he_normal", "go_backwards": false, "return_state": false}, "name": "TCN", "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense", "inbound_nodes": [[["TCN", 0, 0, {}]]]}], "input_layers": [["Input", 0, 0]], "output_layers": [["Dense", 0, 0]]}, "keras_version": "2.12.0", "backend": "tensorflow"}